<?php

namespace Fu\Geo;

/**
 * 地点
 * 三级结构的地点数据
 * 分为两个可能：
 * 国内/省/市/区
 * 海外/洲/国家
 */
class Area
{
    /**
     * 国家/海外
     *
     * @var string
     */
    public $nation = '';

    /**
     * 省/洲
     *
     * @var string
     */
    public $lv1 = '';

    /**
     * 城市/海外国家
     *
     * @var string
     */
    public $lv2 = '';

    /**
     * 区、县
     *
     * @var string
     */
    public $lv3 = '';

    public function getContinent($nation): string
    {
        $oversea = $this->getOversea();
        return $oversea[$nation] ?? '';
    }

    /**
     * @return string
     * @todo   数组中有相同的键会覆盖前者
     */
    public function getOversea(): array
    {
        return array(
            '日本' => '亚洲',
            '朝鲜' => '亚洲',
            '韩国' => '亚洲',
            '蒙古' => '亚洲',
            '俄罗斯' => '亚洲',
            '缅甸' => '亚洲',
            '文莱' => '亚洲',
            '柬埔寨' => '亚洲',
            '东帝汶' => '亚洲',
            '印度尼西亚' => '亚洲',
            '老挝' => '亚洲',
            '马来西亚' => '亚洲',
            '菲律宾' => '亚洲',
            '新加坡' => '亚洲',
            '泰国' => '亚洲',
            '越南' => '亚洲',
            '孟加拉国' => '亚洲',
            '不丹' => '亚洲',
            '印度' => '亚洲',
            '马尔代夫' => '亚洲',
            '尼泊尔' => '亚洲',
            '巴基斯坦' => '亚洲',
            '斯里兰卡' => '亚洲',
            '哈萨克斯坦' => '亚洲',
            '吉尔吉斯斯坦' => '亚洲',
            '土库曼斯坦' => '亚洲',
            '塔吉克斯坦' => '亚洲',
            '乌兹别克斯坦' => '亚洲',
            '阿富汗' => '亚洲',
            '亚美尼亚' => '亚洲',
            '阿塞拜疆' => '亚洲',
            '巴林' => '亚洲',
            '格鲁吉亚' => '亚洲',
            '伊朗' => '亚洲',
            '伊拉克' => '亚洲',
            '以色列' => '亚洲',
            '约旦' => '亚洲',
            '科威特' => '亚洲',
            '黎巴嫩' => '亚洲',
            '阿曼' => '亚洲',
            '巴勒斯坦' => '亚洲',
            '卡塔尔' => '亚洲',
            '沙特阿拉伯' => '亚洲',
            '叙利亚' => '亚洲',
            '土耳其' => '亚洲',
            '阿拉伯联合酋长国' => '亚洲',
            '也门' => '亚洲',
            '比利时' => '欧洲',
            '法国' => '欧洲',
            '爱尔兰' => '欧洲',
            '卢森堡' => '欧洲',
            '摩纳哥' => '欧洲',
            '荷兰' => '欧洲',
            '英国' => '欧洲',
            '奥地利' => '欧洲',
            '德国' => '欧洲',
            '列支敦士登' => '欧洲',
            '瑞士' => '欧洲',
            '丹麦' => '欧洲',
            '芬兰' => '欧洲',
            '冰岛' => '欧洲',
            '挪威' => '欧洲',
            '瑞典' => '欧洲',
            '白俄罗斯' => '欧洲',
            '爱沙尼亚' => '欧洲',
            '拉脱维亚' => '欧洲',
            '立陶宛' => '欧洲',
            '摩尔多瓦' => '欧洲',
            '俄罗斯' => '欧洲',
            '乌克兰' => '欧洲',
            '波兰' => '欧洲',
            '斯洛伐克' => '欧洲',
            '匈牙利' => '欧洲',
            '捷克' => '欧洲',
            '阿尔巴尼亚' => '欧洲',
            '安道尔' => '欧洲',
            '波黑' => '欧洲',
            '保加利亚' => '欧洲',
            '克罗地亚' => '欧洲',
            '希腊' => '欧洲',
            '意大利' => '欧洲',
            '马其顿' => '欧洲',
            '马耳他' => '欧洲',
            '黑山' => '欧洲',
            '葡萄牙' => '欧洲',
            '罗马尼亚' => '欧洲',
            '圣马力诺' => '欧洲',
            '塞尔维亚' => '欧洲',
            '斯洛文尼亚' => '欧洲',
            '西班牙' => '欧洲',
            '梵蒂冈' => '欧洲',
            '亚美尼亚' => '欧洲',
            '阿塞拜疆' => '欧洲',
            '塞浦路斯' => '欧洲',
            '格鲁吉亚' => '欧洲',
            '土耳其' => '欧洲',
            '阿尔及利亚' => '非洲',
            '埃及' => '非洲',
            '利比亚' => '非洲',
            '摩洛哥' => '非洲',
            '苏丹' => '非洲',
            '突尼斯' => '非洲',
            '南苏丹' => '非洲',
            '贝宁' => '非洲',
            '布基纳法索' => '非洲',
            '乍得' => '非洲',
            '科特迪瓦' => '非洲',
            '冈比亚' => '非洲',
            '加纳' => '非洲',
            '几内亚' => '非洲',
            '几内亚比绍' => '非洲',
            '利比里亚' => '非洲',
            '马里' => '非洲',
            '尼日尔' => '非洲',
            '毛里塔尼亚' => '非洲',
            '尼日利亚' => '非洲',
            '塞内加尔' => '非洲',
            '塞拉利昂' => '非洲',
            '多哥' => '非洲',
            '佛得角' => '非洲',
            '喀麦隆' => '非洲',
            '中非' => '非洲',
            '赤道几内亚' => '非洲',
            '加蓬' => '非洲',
            '刚果共和国' => '非洲',
            '刚果民主共和国' => '非洲',
            '圣多美普林西比' => '非洲',
            '安哥拉' => '非洲',
            '博茨瓦纳' => '非洲',
            '科摩罗' => '非洲',
            '莱索托' => '非洲',
            '马达加斯加' => '非洲',
            '马拉维' => '非洲',
            '毛里求斯' => '非洲',
            '莫桑比克' => '非洲',
            '纳米比亚' => '非洲',
            '斯威士兰' => '非洲',
            '南非' => '非洲',
            '赞比亚' => '非洲',
            '津巴布韦' => '非洲',
            '布隆迪' => '非洲',
            '吉布提' => '非洲',
            '厄立特里亚' => '非洲',
            '埃塞俄比亚' => '非洲',
            '肯尼亚' => '非洲',
            '卢旺达' => '非洲',
            '塞舌尔' => '非洲',
            '索马里' => '非洲',
            '坦桑尼亚' => '非洲',
            '乌干达' => '非洲',
            '澳大利亚' => '大洋洲',
            '斐济' => '大洋洲',
            '基里巴斯' => '大洋洲',
            '马绍尔群岛' => '大洋洲',
            '密克罗尼西亚联邦' => '大洋洲',
            '瑙鲁' => '大洋洲',
            '新西兰' => '大洋洲',
            '帕劳' => '大洋洲',
            '巴布亚新几内亚' => '大洋洲',
            '萨摩亚' => '大洋洲',
            '所罗门群岛' => '大洋洲',
            '汤加' => '大洋洲',
            '图瓦卢' => '大洋洲',
            '瓦努阿图' => '大洋洲',
            '加拿大' => '美洲',
            '墨西哥' => '美洲',
            '美国' => '美洲',
            '伯利兹' => '美洲',
            '哥斯达黎加' => '美洲',
            '萨尔瓦多' => '美洲',
            '危地马拉' => '美洲',
            '洪都拉斯' => '美洲',
            '尼加拉瓜' => '美洲',
            '巴拿马' => '美洲',
            '安提瓜和巴布达' => '美洲',
            '巴哈马' => '美洲',
            '巴巴多斯' => '美洲',
            '古巴' => '美洲',
            '多米尼克' => '美洲',
            '多米尼加共和国' => '美洲',
            '格林纳达' => '美洲',
            '海地' => '美洲',
            '牙买加' => '美洲',
            '圣克里斯多福与尼维斯' => '美洲',
            '圣卢西亚' => '美洲',
            '圣文森特和格林纳丁斯' => '美洲',
            '特立尼达和多巴哥' => '美洲',
            '阿根廷' => '美洲',
            '玻利维亚' => '美洲',
            '巴西' => '美洲',
            '智利' => '美洲',
            '哥伦比亚' => '美洲',
            '厄瓜多尔' => '美洲',
            '圭亚那' => '美洲',
            '秘鲁' => '美洲',
            '巴拉圭' => '美洲',
            '苏里南' => '美洲',
            '乌拉圭' => '美洲',
            '委内瑞拉' => '美洲',
        );
    }
}
